tsung_tests/simple_search_single/20151119-1807/simple_search.xml
<?xml version="1.0"?><tsung loglevel="debug" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
  <server host="52.91.203.252" port="8000" type="tcp"/>
</servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
    <option name="file_server" id="search_words" value="./search_words.csv"/>
  </options>

   <sessions>
      <session name="login_search_logout" probability="100" type="ts_http">
      <request><http url="http://52.91.255.203/" version="1.1" method="GET"/></request>
      <request><http url="/css/index.css" version="1.1" method="GET"/></request>
      <request><http url="http://fonts.googleapis.com/css?family=Raleway" version="1.1" method="GET"/></request>
      <request><http url="http://52.91.255.203/favicon.png" version="1.1" method="GET"/></request>
      <request><http url="/index.js" version="1.1" method="GET"/></request>

      <thinktime random="true" value="15"/>

      <setdynvars sourcetype="file" fileid="search_words" delimiter=";" order="random">
        <var name="random_search_keyword"/>
      </setdynvars>

      <request subst="true">
        <http url="/products?search=%%_random_search_keyword%%" version="1.1" method="GET">
        </http>
      </request>
      
      <request>
        <dyn_variable name="authenticity_token"/> 
        <http url="/login" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="num"/>
      </setdynvars>
      
      <request>
        <http url="/assets/application-85f3e37588d64cdc8817d7a50fc3c1d80f51f2e0f103d0a60a467698fe9a7f28.css" version="1.1" method="GET">
        </http>
      </request>

      <request>
        <http url="/assets/application-d3b407e8dc3d82934fb3d97690e3ef706d4d51c4871524fbc3f9fd4dbd1a731c.js" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="http://fonts.googleapis.com/css?family=Lato:400,700" version="1.1" method="GET">
        </http>
      </request>

      <thinktime random="true" value="2"/>

      <request>
        <http url="http://ciscobinary.openh264.org/openh264-macosx64-1539616777fe0f4bd6c3c09e18436e916640c2dd.zip" version="1.1" method="GET">
        </http>
      </request>

      <thinktime random="true" value="6"/>

      <request subst="true">
        <http url="http://52.91.255.203/login" version="1.1" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=user%%_num%%%40gmail.com&amp;session%5Bpassword%5D=123456&amp;commit=Log+in" content_type="application/x-www-form-urlencoded" method="POST">
        </http>
      </request>

      <request>
        <http url="/products" version="1.1" method="GET">
        </http>
      </request>

      <thinktime random="true" value="1"/>

      <request><http url="/css/star-rating.min.css" version="1.1" method="GET"/></request>
      <request><http url="/scripts/star-rating.min.js" version="1.1" method="GET"/></request>

      <thinktime random="true" value="8"/>

      <request subst="true">
        <http url="/products?utf8=%E2%9C%93&amp;search=%%_random_search_keyword%%" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="http://ecx.images-amazon.com/images/I/316rdlcna1L.jpg" version="1.1" method="GET">
        </http>
      </request>

      <request><http url="/images/I/51U2yu%2B7FBL.jpg" version="1.1" method="GET"/></request>
      <request><http url="/images/I/51F%2BQhZq7AL.jpg" version="1.1" method="GET"/></request>
      <request><http url="/images/I/51Yn0FiFm-L.jpg" version="1.1" method="GET"/></request>
      <request><http url="/images/I/41n%2BJTN4TbL.jpg" version="1.1" method="GET"/></request>

      <thinktime random="true" value="3"/>

      <request subst="true">
        <http url="http://52.91.255.203/logout" version="1.1" contents="_method=delete&amp;authenticity_token=%%_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST"/>
      </request>

      <request><http url="/products" version="1.1" method="GET"/></request>
      <request><http url="/login" version="1.1" method="GET"/></request>
      </session>

	</sessions>
</tsung>